app/controllers/books_controller.rb

  def show
    @reviews = Review.where(book_id: @book.id)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = $1  [["book_id", 1]]

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "description", "genre", "created_at", "updated_at", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"