app/controllers/reviews_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("title", "body", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "pésima ayudantia"], ["body", "jaja"], ["book_id", 1], ["created_at", "2019-05-17 15:44:36.125743"], ["updated_at", "2019-05-17 15:44:36.125743"]]
---
  def create
    @review = Review.new(review_params)
    @book = Book.where(id: params[:id])
    respond_to do |format|
      if @review.save